sschiesser/SMS_nRF5_remote/sms_remote2/main.c
enum led_states {
	LED_ON,
	LED_OFF,
	LED_ADVERTISING,
	LED_CONNECTING,
	LED_CONNECTED,
	LED_DISCONNECTED,
	LED_GAP_TIMEOUT,
	LED_RUNNING,
	LED_CALIB_ACCEL,
	LED_CALIB_COMP,
	LED_SWITCHING_OFF,
	LED_ERROR
};
enum pwm_states {
	PWM_OFF,
	PWM_ON
};
enum pwm_pos {
	PWM_CONN = 0,
	PWM_DATA
};
struct batgauge_status_s {
	bool start;
	bool init_ok;
	bool enabled;
	bool new_value;
	uint32_t bat_level;
};
// Application state
typedef struct {
	enum sms_running_states sms;
	enum led_states led[2];
	enum pwm_states pwm[2];
	struct batgauge_status_s batgauge;
}app_state_t;
app_state_t m_app_state;

// LED/buttons
static uint8_t 							m_button_mask = 0;							/* Button mask to remember previous pressing state */
static uint8_t							m_led_blink_cnt = 0;
// Batgauge/SAADC
static nrf_saadc_value_t     			m_buffer_pool[2][ADC_SAMPLES_IN_BUFFER];	/* Buffers to store n ADC samples (averaging) */
static uint32_t							m_adc_evt_counter;							/* ADC event counter (debug) */
// BLE/connection
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;	/* Handle of the current connection */
ble_smss_t								m_smss_service;								/* Structure used to identify the SMS service */
static ble_bas_t 						m_bas;                                   	/* Structure used to identify the battery service */
// PWM
static low_power_pwm_t					low_power_pwm_conn;							/* PWM instance for LED_0 (connection) */
static low_power_pwm_t					low_power_pwm_data;							/* PWM instance for LED_1 (data) */


// Timers
APP_TIMER_DEF(button_press_timer_id);
APP_TIMER_DEF(saadc_timer_id);
APP_TIMER_DEF(led0_timer_id);
APP_TIMER_DEF(led1_timer_id);


/* ====================================================================
 * FUNCTIONS DECLARATIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
void advertising_start(void);
void sensors_stop(void);


/**@brief Application error handler overwitten.
 *
 * @param[in] id
 * @param[in] pc
 * @param[in] info
 */
void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
//NRF_LOG_DEBUG("ERROR! ID: %d, PC: %d, INFO: %d\n\r", id, pc, info);
#ifndef DEBUG
	NVIC_SystemReset();
#else
	while(1){};
#endif //DEBUG
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Blink both LEDs in alternance to signal switch-off procedure.
 *
 * @details For simplification reasons, this function uses a blocking delay. Since everything has
 *			already been disabled before (BLE, PWM, timers) this is not an issue.
 */
static void leds_blink_off(void)
{
	bsp_board_led_on(SMS_DATA_LED_PIN);
	nrf_delay_ms(150);
	bsp_board_led_on(SMS_CONN_LED_PIN);
	nrf_delay_ms(500);
	bsp_board_led_off(SMS_CONN_LED_PIN);
	nrf_delay_ms(150);
	bsp_board_led_off(SMS_DATA_LED_PIN);
	
	bsp_board_leds_off();
}


/**@brief Switch off SMS device.
 *
 * @details	Stop BLE advertising or disconnect, and disable running tasks (PWM, timers).
 *			Only the buttons remain active (for restarting).
 *
* @param[in] restart	If restart is set, reinitialise everything and start advertising (TBD!).
 */
static void sms_switch_off(bool restart)
{
	uint32_t err_code;
	
	NRF_LOG_DEBUG("Switching-off SMS sensors...\n\r");
	
	m_app_state.batgauge.new_value = false;
	m_app_state.batgauge.enabled = false;
	
	if(m_app_state.sms == SMS_ADVERTISING) {
		err_code = sd_ble_gap_adv_stop();
		NRF_LOG_DEBUG("Adv stop err_code: 0x%04x\n\r", err_code);
		if(err_code != 0x0008) {
			APP_ERROR_CHECK(err_code);
		}
		m_app_state.sms = SMS_OFF;
	}
	else if(m_app_state.sms == SMS_RUNNING) {
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		NRF_LOG_INFO("Disconnect err_code: 0x%04x\n\r", err_code);
		if(!restart) {
			m_app_state.sms = SMS_OFF;
		}
	}
	else if(m_app_state.sms == SMS_ADV_TIMEOUT) {
		m_app_state.sms = SMS_OFF;
	}
//	low_power_pwm_stop(&low_power_pwm_conn);
//	low_power_pwm_stop(&low_power_pwm_data);
	app_timer_stop_all();
	
	leds_blink_off();	
	
	m_conn_handle = BLE_CONN_HANDLE_INVALID;
}

/**@brief Switch on SMS device.
 *
 * @details	Start advertising for 120 seconds.
 */
static void sms_switch_on(void)
{
	NRF_LOG_DEBUG("Switching-on SMS sensors...\n\r");
	advertising_start();
}


/* ====================================================================
 * HANDLERS
 * --------------------------------------------------------------------
 * Has to be defined first to be called by the init functions
 * ==================================================================== */
/**@brief Button pressed timeout handler.
 *
 * @details	1. check if and which button is pressed
 *			2. compare the current state with the button mask
 *			3. handle according to the comparison
 *
 * @param[in] p_context	unused
 */
static void button_press_timeout_handler(void * p_context)
{
	uint8_t button_state = 0;
	UNUSED_PARAMETER(p_context);
	
	if(app_button_is_pushed(0)) button_state |= 0x01;
	if(app_button_is_pushed(1)) button_state |= 0x10;
	NRF_LOG_DEBUG("Button long press timeout!! Button state = 0x%02x\n\r", button_state);

	if(button_state == m_button_mask) {
		if(button_state == 0x11) {
			NRF_LOG_DEBUG("DOUBLE long press!! SMS state: %d\n\r", m_app_state.sms);
			if((m_app_state.sms == SMS_ADVERTISING) || (m_app_state.sms == SMS_RUNNING)) {
				sms_switch_off(false);
			}
		}
		else if((button_state == 0x01) || (button_state == 0x10)) {
			NRF_LOG_DEBUG("SINGLE long press!! SMS state: %d\n\r", m_app_state.sms);
			if(m_app_state.sms == SMS_OFF) {
				sms_switch_on();
			}
		}
	}
	// Reset button mask to force complete button release before next detection
	m_button_mask = 0;
}


/**@brief Function for handling the LED0 timer (advertisement)
 *
 * @param[in] none
 */
static void led0_timer_handler(void)
{
	bool lstate = bsp_board_led_state_get(bsp_board_pin_to_led_idx(LED_1));
	NRF_LOG_INFO("LED0 timeout... app_state = %d, led state = %d\n\r", m_app_state.sms, lstate);
	switch(m_app_state.sms) {
		case SMS_ADVERTISING:
			bsp_board_led_invert(SMS_CONN_LED_PIN);
			app_timer_start(led0_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_FAST_MS, UNIT_1_00_MS), 0),
					NULL);
			break;
		
		case SMS_RUNNING:
			m_led_blink_cnt++;
			if(m_led_blink_cnt < SMS_LED_BLINK_CONNECT) {
				bsp_board_led_invert(SMS_CONN_LED_PIN);
				app_timer_start(led0_timer_id,
						APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_ULTRA_MS, UNIT_1_00_MS), 0),
						NULL);
			}
			else{
				NRF_LOG_DEBUG("Connect blinking done\n\r");
				bsp_board_led_off(SMS_CONN_LED_PIN);
				app_timer_stop(led0_timer_id);
				m_app_state.led[1] = LED_ON;
				bsp_board_led_on(SMS_DATA_LED_PIN);
				app_timer_start(led1_timer_id,
						APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_ULTRA_MS, UNIT_1_00_MS), 0),
						NULL);
			}
			break;
			
		default:
			break;
	}
}

static void led1_timer_handler(void)
{
	NRF_LOG_DEBUG("LED1 timeout... state: %d\n\r", m_app_state.led[1]);
	if(m_app_state.led[1] == LED_ON) {
		m_app_state.led[1] = LED_OFF;
		bsp_board_led_off(SMS_DATA_LED_PIN);
		app_timer_start(led1_timer_id,
				APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_SLOW_MS, UNIT_1_00_MS), 0),
				NULL);
	}
	else if(m_app_state.led[1] == LED_OFF) {
		m_app_state.led[1] = LED_ON;
		bsp_board_led_on(SMS_DATA_LED_PIN);
		app_timer_start(led1_timer_id,
				APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_ULTRA_MS, UNIT_1_00_MS), 0),
				NULL);
	}
}


