sschiesser/SMS_nRF5_remote/sms_remote2/main.c
// Hardware interrupts
/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    uint32_t err_code;
	static uint16_t send_value = 0;

    switch (pin_no)
    {
        case SMS_BUTTON1_PIN:
			if(button_action) send_value |= 0xFF;
			else send_value &= 0xFF00;
			NRF_LOG_DEBUG("Bt1 pressed\r\n", send_value);
			err_code = ble_smss_on_button_change(&m_smss_service, send_value);
			if((err_code != NRF_SUCCESS) &&							// 0x0000
				(err_code != NRF_ERROR_INVALID_STATE) &&			// 0x0008
				(err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&		// 0x3002
				(err_code != BLE_ERROR_NO_TX_PACKETS) &&			// 0x3004
				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))		// 0x3401
			{
				APP_ERROR_CHECK(err_code);
			}
			
			if(button_action) m_button_mask |= 0x01;
			else m_button_mask &= 0xF0;
			
			NRF_LOG_DEBUG("Stopping button timer... mask = 0x%02x\n\r", m_button_mask);
			app_timer_stop(button_press_timer_id);
			if(m_button_mask != 0) {
				NRF_LOG_DEBUG("Re-starting button timer...\n\r");
				app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);		
			}
			
            break;

		case SMS_BUTTON2_PIN:
			if(button_action) send_value |= 0xFF00;
			else send_value &= 0x00FF;
			NRF_LOG_DEBUG("Bt2 pressed\r\n", send_value);
			err_code = ble_smss_on_button_change(&m_smss_service, send_value);
			if((err_code != NRF_SUCCESS) &&							// 0x0000
				(err_code != NRF_ERROR_INVALID_STATE) &&			// 0x0008
				(err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&		// 0x3002
				(err_code != BLE_ERROR_NO_TX_PACKETS) &&			// 0x3004
				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))		// 0x3401
			{
				APP_ERROR_CHECK(err_code);
			}

			if(button_action) m_button_mask |= 0x10;
			else m_button_mask &= 0x0F;
			
			NRF_LOG_DEBUG("Stopping button timer... mask = 0x%02x\n\r", m_button_mask);
			app_timer_stop(button_press_timer_id);
			if(m_button_mask != 0) {
				NRF_LOG_DEBUG("Re-starting button timer...\n\r");
				app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);		
			}

			break;
		
        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for handling a batgauge event.
 *
 * @details	After ADC_SAMPLES_IN_BUFFER ADC sampling, the batgauge handler is called to calculate a
 *			battery level value and set the new value flag.
 *
 * @param[in] p_event	Select which SAADC event has called the handler
 */
void batgauge_event_handler(nrf_drv_saadc_evt_t const * p_event)
{
	NRF_LOG_DEBUG("Batgauge event!!\n\r");
	if(p_event->type == NRF_DRV_SAADC_EVT_DONE)
	{
		ret_code_t err_code;
		err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, ADC_SAMPLES_IN_BUFFER);
		APP_ERROR_CHECK(err_code);
		
		uint8_t i;
		uint32_t sum = 0;
		NRF_LOG_DEBUG("ADC event number: %d\n\r", (int)m_adc_evt_counter);
		for(i = 0; i < ADC_SAMPLES_IN_BUFFER; i++)
		{
			m_buffer_pool[0][i] = p_event->data.done.p_buffer[i];
			NRF_LOG_DEBUG("%d\r\n", m_buffer_pool[0][i]);
			sum += m_buffer_pool[0][i];
		}
		float adc = (float)sum / ADC_SAMPLES_IN_BUFFER;
		float level = (float)BAT_CONV_DELTA * adc + (float)BAT_CONV_OFFSET;
		if(level > 100) level = 100;
		m_app_state.batgauge.bat_level = (uint32_t)level;
//		m_app_state.batgauge.bat_level = (uint32_t)adc;
		NRF_LOG_DEBUG("Batgauge avg: %d (sum: %d)\n\r", m_app_state.batgauge.bat_level, sum);
		m_adc_evt_counter++;
		m_app_state.batgauge.new_value = true;
	}
}

/**@brief Function for handling the saadc timer.
 *
 * @details	Start a new SAADC sampling sequence.
 *
 * @param[in] p_context	unused
 */
static void saadc_timer_handler(void * p_context)
{
//	NRF_LOG_DEBUG("saadc timer done\n\r");
//	nrf_drv_saadc_sample();
}

/**@brief Function for handling the PWM event for connection LED.
 *
 * @details	Depending on the PWM instance and the current LED state, toggle the
 *			PWM or switch it off.
 *
 * @param[in] p_context	Select the PWM instance which has called the handler.
 */
static void pwm_conn_handler(void * p_context)
{
//	static uint16_t change_cnt;
//	static uint8_t blink_cnt;
//	uint32_t max_changes = 0;
//	uint8_t max_blinks = 0;
//	
//	uint32_t err_code;

//	low_power_pwm_t * pwm_instance = (low_power_pwm_t*)p_context;
//	
//	// Commands for LED_0
//	if(pwm_instance->bit_mask == BSP_LED_0_MASK)
//	{
//		switch(m_app_state.led[0]) {
//			case LED_ADVERTISING:
//				max_changes = SMS_LED_BLINK_MEDIUM_TICKS;
//				max_blinks = 0;
//				break;
//			case LED_CONNECTING:
//				max_changes = SMS_LED_BLINK_ULTRA_TICKS;
//				max_blinks = 4;
//				break;
//			default:
//				break;
//		}

//		change_cnt++;
//		
//		if(change_cnt > max_changes) {
//			switch(m_app_state.led[0]) {
//				case LED_ADVERTISING:
//					if(pwm_instance->duty_cycle > 0) {
//						err_code = low_power_pwm_duty_set(pwm_instance, 0);
//					}
//					else {
//						err_code = low_power_pwm_duty_set(pwm_instance, SMS_LED_ON_DUTY);
//					}
//					APP_ERROR_CHECK(err_code);
//					break;
//					
//				case LED_CONNECTING:
//					if(pwm_instance->duty_cycle > 0) {
//						blink_cnt++;
//						err_code = low_power_pwm_duty_set(pwm_instance, 0);
//					}
//					else {
//						err_code = low_power_pwm_duty_set(pwm_instance, SMS_LED_ON_DUTY);
//					}
//					APP_ERROR_CHECK(err_code);
//					
//					if(blink_cnt > max_blinks) {
//						blink_cnt = 0;
////						m_app_state.pwm[0] = PWM_OFF;
////						m_app_state.led[0] = LED_CONNECTED;
//						m_app_state.sms = SMS_RUNNING;
////						m_app_state.batgauge.start = true;
//					}
//					break;
//						
//				default:
//					break;
//			}

//			change_cnt = 0;
//		}
//	}
}

/**@brief Function for handling the PWM event for data LED.
 *
 * @details	Depending on the PWM instance and the current LED state, toggle the
 *			PWM or switch it off.
 *
 * @param[in] p_context	Select the PWM instance which has called the handler.
 */
static void pwm_data_handler(void * p_context)
{
//	static uint16_t change_cnt;
//	static uint8_t duty_cnt;
//	uint32_t max_changes = 0;
//	uint8_t max_duty = 0;
//	
//	uint32_t err_code;
//	
//	low_power_pwm_t * pwm_instance = (low_power_pwm_t*)p_context;

//	switch(m_app_state.led[1]) {
//		case LED_RUNNING:
//			max_changes = SMS_LED_BLINK_FAST_TICKS;
//			max_duty = 100/SMS_LED_RUNNING_DUTY;
//			break;
//		case LED_CALIB_ACCEL:
//			max_changes = SMS_LED_BLINK_MEDIUM_TICKS;
//			break;
//		default:
//			break;
//	}
//	
//	change_cnt++;
//		
//	if(change_cnt > max_changes) {
//		switch(m_app_state.led[1]) {
//			case LED_RUNNING:
//				if(pwm_instance->duty_cycle > 0) {
//					duty_cnt = 0;
//					err_code = low_power_pwm_duty_set(pwm_instance, 0);
//				}
//				else {
//					duty_cnt++;
//					if(duty_cnt > max_duty) {
//						err_code = low_power_pwm_duty_set(pwm_instance, SMS_LED_ON_DUTY);
//					}
//					else {
//						err_code = low_power_pwm_duty_set(pwm_instance, 0);
//					}
//				}
//				APP_ERROR_CHECK(err_code);
//				break;
//				
//			case LED_CALIB_ACCEL:
//				if(pwm_instance->duty_cycle > 0) {
//					err_code = low_power_pwm_duty_set(pwm_instance, 0);
//				}
//				else {
//					err_code = low_power_pwm_duty_set(pwm_instance, SMS_LED_ON_DUTY);
//				}
//				APP_ERROR_CHECK(err_code);
//				break;
//					
//			case LED_DISCONNECTED:
//				m_app_state.pwm[1] = PWM_OFF;
//				break;
//			
//			default:
//				break;
//		}

//		change_cnt = 0;
//	}
}

// BLE
/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}
/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;
	
    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
//            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
//            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
//            sleep_mode_enter();
            break;
        default:
            break;
    }
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

