sschiesser/SMS_nRF5_remote/sms_remote2/main.c
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling the Application's BLE stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
			NRF_LOG_DEBUG("Connected\r\n");
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
//			m_app_state.led[0] = LED_CONNECTING;
//			m_app_state.pwm[1] = PWM_ON;
//			m_app_state.led[1] = LED_RUNNING;
//			low_power_pwm_start(&low_power_pwm_data, low_power_pwm_data.bit_mask);
//			NRF_LOG_DEBUG("Stopping timer\n\r");
//			app_timer_stop(led0_timer_id);
			m_app_state.sms = SMS_CONNECTING;
//			m_led_blink_cnt = 0;
//			bsp_board_led_invert(SMS_CONN_LED_PIN);
//			NRF_LOG_DEBUG("Starting timer\n\r");
//			app_timer_start(led0_timer_id,
//					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_FAST_MS, UNIT_1_00_MS), 0),
//					NULL);
					
            break; // BLE_GAP_EVT_CONNECTED

        case BLE_GAP_EVT_DISCONNECTED:
			NRF_LOG_DEBUG("Disconnected\r\n");
//			m_app_state.led[1] = LED_DISCONNECTED;
			sensors_stop();
			if(m_app_state.sms == SMS_RUNNING) {
				m_app_state.sms = SMS_ADV_START;
			}

            break; // BLE_GAP_EVT_DISCONNECTED

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                                   BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                                                   NULL,
                                                   NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GAP_EVT_SEC_PARAMS_REQUEST
		
		case BLE_GAP_EVT_TIMEOUT:
			NRF_LOG_DEBUG("GAP Event Timeout.\r\n");
			m_app_state.led[0] = LED_GAP_TIMEOUT;
			sms_switch_off(false);
			break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_SYS_ATTR_MISSING

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
			NRF_LOG_DEBUG("GATT Client Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
			NRF_LOG_DEBUG("GATT Server Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT

        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t  req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = SMS_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

#if (NRF_SD_BLE_API_VERSION == 3)
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                       NRF_BLE_MAX_MTU_SIZE);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

        default:
            // No implementation needed.
            break;
    }
}
/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack
 *          event has been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    on_ble_evt(p_ble_evt);
    ble_smss_on_ble_evt(&m_smss_service, p_ble_evt);
	ble_bas_on_ble_evt(&m_bas, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
}
/* ====================================================================
 * INITIALIZATIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
// Board
/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_leds_init();
//	uint32_t err_code;
//	low_power_pwm_config_t low_power_pwm_config;
//	low_power_pwm_config.active_high = false;
//	low_power_pwm_config.period = SMS_PWM_PERIOD;
//	low_power_pwm_config.bit_mask = BSP_LED_0_MASK;
//	low_power_pwm_config.p_timer_id = &led0_timer_id;
//	low_power_pwm_config.p_port = NRF_GPIO;
//	
//	m_app_state.pwm[0] = PWM_OFF;
//	err_code = low_power_pwm_init((&low_power_pwm_conn), &low_power_pwm_config, pwm_conn_handler);
//	APP_ERROR_CHECK(err_code);
//	err_code = low_power_pwm_duty_set(&low_power_pwm_conn, SMS_LED_ON_DUTY);
//	APP_ERROR_CHECK(err_code);
//	
//	low_power_pwm_config.active_high = false;
//	low_power_pwm_config.period = SMS_PWM_PERIOD;
//	low_power_pwm_config.bit_mask = BSP_LED_1_MASK;
//	low_power_pwm_config.p_timer_id = &led1_timer_id;
//	low_power_pwm_config.p_port = NRF_GPIO;
//	
//	m_app_state.pwm[1] = PWM_OFF;
//	err_code = low_power_pwm_init((&low_power_pwm_data), &low_power_pwm_config, pwm_data_handler);
//	APP_ERROR_CHECK(err_code);
//	err_code = low_power_pwm_duty_set(&low_power_pwm_data, SMS_LED_ON_DUTY);
//	APP_ERROR_CHECK(err_code);
}


/**@brief Function to initialize the battery gauge.
 *
 * @details Configure the SAADC channel and the sample buffer. But DON'T START!
 */
static void batgauge_init(void)
{
	NRF_LOG_DEBUG("Preparing AIN0 as battery level input\r\n");
	ret_code_t err_code;
	nrf_saadc_channel_config_t channel_config =
		NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0);
	
