sschiesser/SMS_nRF5_remote/sms_remote2/main.c
	err_code = nrf_drv_saadc_init(NULL, batgauge_event_handler);
	APP_ERROR_CHECK(err_code);
	
	err_code = nrf_drv_saadc_channel_init(0, &channel_config);
	APP_ERROR_CHECK(err_code);
	
	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0], ADC_SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);
	
	err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], ADC_SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);
	
	m_app_state.batgauge.init_ok = true;
	m_app_state.batgauge.enabled = false;
	m_app_state.batgauge.start = false;
}




/**@brief Function for initialising the button handler module.
 */
static void buttons_init(void)
{
    uint32_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {SMS_BUTTON1_PIN, false, BUTTON_PULL, button_event_handler},
		{SMS_BUTTON2_PIN, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                               SMS_BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


// Drivers
/**@brief Function for the Timer initialization.
 *
 * @details Create the timer modules. BUT DON'T START!
 */
static void timers_init(void)
{
	uint32_t err_code;

    // Initialize application timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	
	// Create timers...
	// - button long pressing timer
	err_code = app_timer_create(&button_press_timer_id,
								APP_TIMER_MODE_SINGLE_SHOT,
								button_press_timeout_handler);
	APP_ERROR_CHECK(err_code);
	
	// - SAADC polling
	err_code = app_timer_create(&saadc_timer_id,
								APP_TIMER_MODE_REPEATED,
								saadc_timer_handler);
	APP_ERROR_CHECK(err_code);
	
	// - LEDs blinking timers
	err_code = app_timer_create(&led0_timer_id,
								APP_TIMER_MODE_SINGLE_SHOT,
								led0_timer_handler);
	APP_ERROR_CHECK(err_code);
	err_code = app_timer_create(&led1_timer_id,
								APP_TIMER_MODE_SINGLE_SHOT,
								led1_timer_handler);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting the bootloader for 3 minutes
 *
 * @details	Set the new value in GPREGRET, disable sd and reset
 *
 * @param[in] conn_handle	The current BLE connection handle needed to disconnect.
 */
static void bootloader_start(uint16_t conn_handle)
{
	uint32_t err_code;
	
	/* Force disconnect, disable softdevice, and then reset */
	sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	// The below requires at least bootloader 3.1
//	err_code = sd_power_gpregret_set(BOOTLOADER_DFU_START, 0x000000FF);
	err_code = sd_power_gpregret_set(0, BOOTLOADER_DFU_START);
	APP_ERROR_CHECK(err_code);
	
	sd_softdevice_disable();
	
	nrf_delay_us(500 * 1000);
	
	//reset system to start the bootloader
	NVIC_SystemReset();
}

	


// BLE
/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)SMS_DEVICE_NAME,
                                          strlen(SMS_DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = SMS_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = SMS_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the reception of a write command.
 *
 * @details	Concatenate the received data into a 32bit value and check
 * 			check for the corresponding command.
 *
 * @param[in] p_smss	SMS service struct containing the connection handle
 * @param[in] data		Pointer to the command data
 */
static void app_write_function(ble_smss_t * p_smss, uint8_t *data)
{
	uint32_t command =	(data[0] + (data[1] << 8) +
						(data[2] << 16) + (data[3] << 24));
	NRF_LOG_DEBUG("Received app update command: %#x\n\r", command);
	if(command == 0x1c57b007) {
		NRF_LOG_DEBUG("Restarting device with 3 min bootloader...\n\r");
		bootloader_start(p_smss->conn_handle);
//		NRF_LOG_DEBUG("Closed loop latency test\n\r");
//		ble_smss_on_button_change(&m_smss_service, 0x1234);
	}
//	else if(command == 0x11223344)
//	{
//		NRF_LOG_DEBUG("Closed loop latency test\n\r");
//		ble_smss_on_button_change(&m_smss_service, 0x1234);
//	}
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
	uint32_t err_code;
	
