sschiesser/SMS_nRF5_remote/sms_remote2/main.c
	ble_smss_init_t init;
	init.app_write_function = app_write_function;
	ble_smss_init(&m_smss_service, &init);
	 
    ble_bas_init_t bas_init;

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

	// Here the sec level for the Battery Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    uint32_t             err_code;

	NRF_LOG_INFO("Starting advertising for %d seconds\n\r", SMS_ADV_TIMEOUT_IN_SECONDS);

	m_app_state.sms = SMS_ADVERTISING;
	m_app_state.led[0] = LED_ON;
	bsp_board_led_on(SMS_CONN_LED_PIN);
	err_code = app_timer_start(led0_timer_id, 
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_FAST_MS, UNIT_1_00_MS), 0),
					NULL);
	
//	m_app_state.pwm[0] = PWM_ON;
//	m_app_state.led[0] = LED_ADVERTISING;
//	err_code = low_power_pwm_start((&low_power_pwm_conn), low_power_pwm_conn.bit_mask);
//	APP_ERROR_CHECK(err_code);
	
	err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(err_code);
}


/* ====================================================================
 * RUN-TIME FUNCTIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


/**@brief Stop all sensors.
 *
 * @details	1. switch off the power supplies (pressure, imu)
 *			2. stop the polling timer (pressure, imu, batgauge)
 *			3. clear the enabled flag for all sensors
 */
void sensors_stop(void)
{
//	app_timer_stop(saadc_timer_id);
	m_app_state.batgauge.enabled = false;
}

/**@brief Start the button push timer in order to detect a long push.
 */
void button_press_timer_start(void)
{
	app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);
}



/* ====================================================================
 * MAIN
 * ==================================================================== */
/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    
    // Setup log
	err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);
	uint8_t fw_msb, fw_lsb;
	fw_msb = ((SMS_VERSION_ID & 0xFF) > 8);
	fw_lsb = (SMS_VERSION_ID & 0x0F);
	NRF_LOG_INFO("===============================\n\r");
	NRF_LOG_INFO("SMS sensors firmware v%d.%d, r%03d\n\r", fw_msb, fw_lsb, SMS_RELEASE_ID);
	NRF_LOG_INFO("===============================\n\n\r");

	// Initialize hardware & services
    timers_init();
    leds_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

//	batgauge_init();
	
	// Initialize & configure peripherals
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
		
	// Start advertising
//	advertising_start();
	m_app_state.sms = SMS_ADV_START;

    // Enter main loop.
    for (;;)
    {
		// PWM switch-off command cannot be set in the pwm_handler...
//		if(m_app_state.pwm[0] == PWM_OFF) low_power_pwm_stop(&low_power_pwm_conn);
//		if(m_app_state.pwm[1] == PWM_OFF) low_power_pwm_stop(&low_power_pwm_data);

		switch(m_app_state.sms)
		{
			case SMS_ADV_START:
				NRF_LOG_DEBUG("Starting advertising for 30 seconds\n\r");
				bsp_board_led_off(SMS_DATA_LED_PIN);
				app_timer_stop(led1_timer_id);
				advertising_start();
				break;
			
			case SMS_CONNECTING:
				NRF_LOG_DEBUG("Stopping timer\n\r");
				app_timer_stop(led0_timer_id);
				m_app_state.sms = SMS_RUNNING;
				m_led_blink_cnt = 0;
				bsp_board_led_invert(SMS_CONN_LED_PIN);
				NRF_LOG_DEBUG("Starting timer\n\r");
				app_timer_start(led0_timer_id,
						APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_LED_BLINK_ULTRA_MS, UNIT_1_00_MS), 0),
						NULL);
				break;
			
			default:
				break;
		}
		
		// Start flag of the battery gauge (SAADC)
		if(m_app_state.batgauge.start)
		{
//			nrf_drv_saadc_sample();
//			app_timer_start(saadc_timer_id,
//							APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BATGAUGE_SAMPLE_RATE_MS, UNIT_1_00_MS), 0),
//							NULL);
//			m_app_state.batgauge.enabled = true;
//			m_app_state.batgauge.start = false;
		}

		// New value flag of the battery gauge... sends notification automatically
		if(m_app_state.batgauge.new_value)
		{
//			m_app_state.batgauge.new_value = false;
//			uint32_t err_code;
//			err_code = ble_bas_battery_level_update(&m_bas, (uint8_t)m_app_state.batgauge.bat_level);
//			if((err_code != NRF_SUCCESS) &&							// 0x0000
//				(err_code != NRF_ERROR_INVALID_STATE) &&			// 0x0008
//				(err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&		// 0x3002
//				(err_code != BLE_ERROR_NO_TX_PACKETS) &&			// 0x3004
//				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))		// 0x3401
//			{
//				APP_ERROR_HANDLER(err_code);
//			}
		}

        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
	}
}


/**
 * @}
 */
